# HOUSING UNITS

## Setting up Jupyter notebook display

In [10]:
# Import pandas a python library
import pandas as pd

# Display more rows
pd.set_option('display.max_rows', 15000)
pd.set_option('display.max_columns', 1000)
pd.set_option('display.width', 1000)

# Increase display size
from IPython.core.display import display, HTML
display(HTML("<style>.container {width:90% !important;}</style>"))

## Getting Started: Load ipython-sql and import Create_engine

In [11]:
# Load ipython-sql, using the following magic command:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
# Next, we will only need the create_engine() function from sqlalchemy so let’s import that with the following line:
from sqlalchemy import create_engine

## Connecting to a PostgreSQL the database
Once we’ve laid the groundwork, we can now connect to a PostgreSQL database!
The PostgreSQL database contains housing report data projects data in the portfolio database.

In [13]:
# Use the following format to connect ipython-sql to the portfolio database.
%sql postgresql://postgres:1372Sql$@localhost/portfolio

In [14]:
# To connect sqlalchemy to the database
engine = create_engine('postgresql://postgres:1372Sql$@localhost/portfolio')

## An exploration of the live table storing all of the Housing Units data

In [19]:
%%sql
SELECT * FROM housing_units
LIMIT 10

 * postgresql://postgres:***@localhost/portfolio
10 rows affected.

[(1968.0, 1.0, 'January', 35.6, 17.0, 22.6, 12.9),
 (1968.0, 2.0, 'February', 31.5, 18.6, 23.3, 9.7),
 (1968.0, 3.0, 'March', 42.5, 17.4, 24.4, 10.7),
 (1968.0, 4.0, 'April', 42.9, 20.6, 27.0, 12.0),
 (1968.0, 5.0, 'May', 46.2, 20.0, 25.1, 20.0),
 (1968.0, 6.0, 'June', 37.7, 23.2, 26.9, 16.8),
 (1968.0, 7.0, 'July', 50.3, 21.2, 25.7, 20.1),
 (1968.0, 8.0, 'August', 46.6, 23.1, 33.4, 15.3),
 (1968.0, 9.0, 'September', 48.7, 22.0, 37.9, 27.0),
 (1968.0, 10.0, 'October', 50.2, 23.0, 34.2, 20.5)]

In [20]:
%%sql
SELECT south, west AS "West Region" FROM housing_units
LIMIT 20

 * postgresql://postgres:***@localhost/portfolio
20 rows affected.

[(35.6, 17.0),
 (31.5, 18.6),
 (42.5, 17.4),
 (42.9, 20.6),
 (46.2, 20.0),
 (37.7, 23.2),
 (50.3, 21.2),
 (46.6, 23.1),
 (48.7, 22.0),
 (50.2, 23.0),
 (45.7, 18.4),
 (49.8, 21.6),
 (40.1, 19.7),
 (34.8, 23.0),
 (53.3, 21.1),
 (38.1, 20.9),
 (50.9, 22.8),
 (53.7, 23.5),
 (46.5, 25.4),
 (45.8, 22.3)]

## Capitalize first letter of column

In [24]:
%%sql
SELECT year AS "Year", month AS "Month", month_name AS "Month_name", south AS "South", west AS "West", midwest AS "Midwest", northeast AS Northeast FROM housing_units
LIMIT 15

 * postgresql://postgres:***@localhost/portfolio
15 rows affected.

[(1968.0, 1.0, 'January', 35.6, 17.0, 22.6, 12.9),
 (1968.0, 2.0, 'February', 31.5, 18.6, 23.3, 9.7),
 (1968.0, 3.0, 'March', 42.5, 17.4, 24.4, 10.7),
 (1968.0, 4.0, 'April', 42.9, 20.6, 27.0, 12.0),
 (1968.0, 5.0, 'May', 46.2, 20.0, 25.1, 20.0),
 (1968.0, 6.0, 'June', 37.7, 23.2, 26.9, 16.8),
 (1968.0, 7.0, 'July', 50.3, 21.2, 25.7, 20.1),
 (1968.0, 8.0, 'August', 46.6, 23.1, 33.4, 15.3),
 (1968.0, 9.0, 'September', 48.7, 22.0, 37.9, 27.0),
 (1968.0, 10.0, 'October', 50.2, 23.0, 34.2, 20.5),
 (1968.0, 11.0, 'November', 45.7, 18.4, 35.8, 14.4),
 (1968.0, 12.0, 'December', 49.8, 21.6, 31.2, 19.5),
 (1969.0, 1.0, 'January', 40.1, 19.7, 18.0, 11.0),
 (1969.0, 2.0, 'February', 34.8, 23.0, 23.3, 14.9),
 (1969.0, 3.0, 'March', 53.3, 21.1, 23.5, 17.0)]